GopalSaraf/Practicals/PSDL/include/proc/pic16f527.inc
// Register: INTCON1
#define INTCON1 INTCON1
INTCON1                                  equ 0065h
// bitfield definitions
INTCON1_WUR_POSN                         equ 0000h
INTCON1_WUR_POSITION                     equ 0000h
INTCON1_WUR_SIZE                         equ 0001h
INTCON1_WUR_LENGTH                       equ 0001h
INTCON1_WUR_MASK                         equ 0001h
INTCON1_RAIE_POSN                        equ 0004h
INTCON1_RAIE_POSITION                    equ 0004h
INTCON1_RAIE_SIZE                        equ 0001h
INTCON1_RAIE_LENGTH                      equ 0001h
INTCON1_RAIE_MASK                        equ 0010h
INTCON1_T0IE_POSN                        equ 0005h
INTCON1_T0IE_POSITION                    equ 0005h
INTCON1_T0IE_SIZE                        equ 0001h
INTCON1_T0IE_LENGTH                      equ 0001h
INTCON1_T0IE_MASK                        equ 0020h
INTCON1_CWIE_POSN                        equ 0006h
INTCON1_CWIE_POSITION                    equ 0006h
INTCON1_CWIE_SIZE                        equ 0001h
INTCON1_CWIE_LENGTH                      equ 0001h
INTCON1_CWIE_MASK                        equ 0040h
INTCON1_ADIE_POSN                        equ 0007h
INTCON1_ADIE_POSITION                    equ 0007h
INTCON1_ADIE_SIZE                        equ 0001h
INTCON1_ADIE_LENGTH                      equ 0001h
INTCON1_ADIE_MASK                        equ 0080h

// Register: ISTATUS
#define ISTATUS ISTATUS
ISTATUS                                  equ 0066h
// bitfield definitions
ISTATUS_C_POSN                           equ 0000h
ISTATUS_C_POSITION                       equ 0000h
ISTATUS_C_SIZE                           equ 0001h
ISTATUS_C_LENGTH                         equ 0001h
ISTATUS_C_MASK                           equ 0001h
ISTATUS_DC_POSN                          equ 0001h
ISTATUS_DC_POSITION                      equ 0001h
ISTATUS_DC_SIZE                          equ 0001h
ISTATUS_DC_LENGTH                        equ 0001h
ISTATUS_DC_MASK                          equ 0002h
ISTATUS_Z_POSN                           equ 0002h
ISTATUS_Z_POSITION                       equ 0002h
ISTATUS_Z_SIZE                           equ 0001h
ISTATUS_Z_LENGTH                         equ 0001h
ISTATUS_Z_MASK                           equ 0004h
ISTATUS_nPD_POSN                         equ 0003h
ISTATUS_nPD_POSITION                     equ 0003h
ISTATUS_nPD_SIZE                         equ 0001h
ISTATUS_nPD_LENGTH                       equ 0001h
ISTATUS_nPD_MASK                         equ 0008h
ISTATUS_nTO_POSN                         equ 0004h
ISTATUS_nTO_POSITION                     equ 0004h
ISTATUS_nTO_SIZE                         equ 0001h
ISTATUS_nTO_LENGTH                       equ 0001h
ISTATUS_nTO_MASK                         equ 0010h
ISTATUS_PA0_POSN                         equ 0005h
ISTATUS_PA0_POSITION                     equ 0005h
ISTATUS_PA0_SIZE                         equ 0001h
ISTATUS_PA0_LENGTH                       equ 0001h
ISTATUS_PA0_MASK                         equ 0020h
ISTATUS_PA1_POSN                         equ 0006h
ISTATUS_PA1_POSITION                     equ 0006h
ISTATUS_PA1_SIZE                         equ 0001h
ISTATUS_PA1_LENGTH                       equ 0001h
ISTATUS_PA1_MASK                         equ 0040h

// Register: IFSR
#define IFSR IFSR
IFSR                                     equ 0067h
// bitfield definitions
IFSR_IFSR_POSN                           equ 0000h
IFSR_IFSR_POSITION                       equ 0000h
IFSR_IFSR_SIZE                           equ 0007h
IFSR_IFSR_LENGTH                         equ 0007h
IFSR_IFSR_MASK                           equ 007Fh

// Register: IBSR
#define IBSR IBSR
IBSR                                     equ 0068h
// bitfield definitions
IBSR_IBSR_POSN                           equ 0000h
IBSR_IBSR_POSITION                       equ 0000h
IBSR_IBSR_SIZE                           equ 0002h
IBSR_IBSR_LENGTH                         equ 0002h
IBSR_IBSR_MASK                           equ 0003h

// Register: OPACON
#define OPACON OPACON
OPACON                                   equ 0069h
// bitfield definitions
OPACON_OPA1ON_POSN                       equ 0000h
OPACON_OPA1ON_POSITION                   equ 0000h
OPACON_OPA1ON_SIZE                       equ 0001h
OPACON_OPA1ON_LENGTH                     equ 0001h
OPACON_OPA1ON_MASK                       equ 0001h
OPACON_OPA2ON_POSN                       equ 0001h
OPACON_OPA2ON_POSITION                   equ 0001h
OPACON_OPA2ON_SIZE                       equ 0001h
OPACON_OPA2ON_LENGTH                     equ 0001h
OPACON_OPA2ON_MASK                       equ 0002h

// Register: TRISA
#define TRISA TRISA

// Register: TRISB
#define TRISB TRISB

// Register: TRISC
#define TRISC TRISC

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 01FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 01Fh)
#endif
#define ADCS0                            BANKMASK(ADCON0), 6
#define ADCS1                            BANKMASK(ADCON0), 7
#define ADIE                             BANKMASK(INTCON1), 7
#define ADIF                             BANKMASK(INTCON0), 7
#define ADON                             BANKMASK(ADCON0), 0
#define ADRES0                           BANKMASK(ADRES), 0
#define ADRES1                           BANKMASK(ADRES), 1
#define ADRES2                           BANKMASK(ADRES), 2
#define ADRES3                           BANKMASK(ADRES), 3
#define ADRES4                           BANKMASK(ADRES), 4
#define ADRES5                           BANKMASK(ADRES), 5
#define ADRES6                           BANKMASK(ADRES), 6
#define ADRES7                           BANKMASK(ADRES), 7
#define ANS0                             BANKMASK(ANSEL), 0
#define ANS1                             BANKMASK(ANSEL), 1
#define ANS2                             BANKMASK(ANSEL), 2
#define ANS3                             BANKMASK(ANSEL), 3
#define ANS4                             BANKMASK(ANSEL), 4
#define ANS5                             BANKMASK(ANSEL), 5
#define ANS6                             BANKMASK(ANSEL), 6
#define ANS7                             BANKMASK(ANSEL), 7
#define C1NREF                           BANKMASK(CM1CON0), 2
#define C1ON                             BANKMASK(CM1CON0), 3
#define C1OUT                            BANKMASK(CM1CON0), 7
#define C1POL                            BANKMASK(CM1CON0), 5
#define C1PREF                           BANKMASK(CM1CON0), 1
#define C2NREF                           BANKMASK(CM2CON0), 2
#define C2ON                             BANKMASK(CM2CON0), 3
#define C2OUT                            BANKMASK(CM2CON0), 7
#define C2POL                            BANKMASK(CM2CON0), 5
#define C2PREF1                          BANKMASK(CM2CON0), 1
#define C2PREF2                          BANKMASK(CM2CON0), 4
#define CAL0                             BANKMASK(OSCCAL), 1
#define CAL1                             BANKMASK(OSCCAL), 2
#define CAL2                             BANKMASK(OSCCAL), 3
#define CAL3                             BANKMASK(OSCCAL), 4
#define CAL4                             BANKMASK(OSCCAL), 5
#define CAL5                             BANKMASK(OSCCAL), 6
#define CAL6                             BANKMASK(OSCCAL), 7
#define CARRY                            BANKMASK(STATUS), 0
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CWIE                             BANKMASK(INTCON1), 6
#define CWIF                             BANKMASK(INTCON0), 6
#define FREE                             BANKMASK(EECON), 4
#define GIE                              BANKMASK(INTCON0), 0
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define NOT_DONE                         BANKMASK(ADCON0), 1
#define OPA1ON                           BANKMASK(OPACON), 0
#define OPA2ON                           BANKMASK(OPACON), 1
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RAIE                             BANKMASK(INTCON1), 4
#define RAIF                             BANKMASK(INTCON0), 4
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RD                               BANKMASK(EECON), 0
#define T0IE                             BANKMASK(INTCON1), 5
#define T0IF                             BANKMASK(INTCON0), 5
#define VR0                              BANKMASK(VRCON), 0
#define VR1                              BANKMASK(VRCON), 1
#define VR2                              BANKMASK(VRCON), 2
#define VR3                              BANKMASK(VRCON), 3
#define VREN                             BANKMASK(VRCON), 7
#define VROE                             BANKMASK(VRCON), 6
#define VRR                              BANKMASK(VRCON), 5
#define WR                               BANKMASK(EECON), 1
#define WREN                             BANKMASK(EECON), 2
#define WRERR                            BANKMASK(EECON), 3
#define WUR                              BANKMASK(INTCON1), 0
#define ZERO                             BANKMASK(STATUS), 2
#define nC1OUTEN                         BANKMASK(CM1CON0), 6
#define nC1T0CS                          BANKMASK(CM1CON0), 4
#define nC1WU                            BANKMASK(CM1CON0), 0
#define nC2OUTEN                         BANKMASK(CM2CON0), 6
#define nC2WU                            BANKMASK(CM2CON0), 0

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16F527_INC_
